Revit 2027 API
AreaReinforcementCurve.Curve Property
Returns the 3D curve forming part of the boundary of an Area Reinforcement element.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Curve Curve { get; }
Public ReadOnly Property Curve As Curve
	Get
public:
property Curve^ Curve {
	Curve^ get ();
}
member Curve : Curve with get
Property Value
Curve
See Also
Reference
AreaReinforcementCurve Class
Autodesk.Revit.DB.Structure Namespace